<a href="https://colab.research.google.com/github/datawilly/procesamiento-de-datos/blob/main/ROSALES_WILLIAM_PEC_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<a name = "inicio"></a>
![image-2.png](attachment:image-2.png)
<p style="text-align:center;font-size:30px;font-weight: bold;">PRUEBA DE EVALUACIÓN CONTINUA</p>

# Objetivos

El objetivo de esta PEC es evaluar el conocimiento del alumno en el uso de las librerías de Python **NumPy**, **pandas**, **matplotlib** y **Seaborn**, aplicándolas en la visualización y transformación de conjuntos de datos.

La prueba consta de tres bloques de preguntas correspondientes a tres niveles de dificultad:

* **Nivel básico**, en las que el alumno deberá ser capaz de realizar tareas, ejercicios o prácticas similares a las aprendidas en la documentación del módulo.
* **Nivel intermedio**, en las que el alumno deberá ser capaz de aplicar las técnicas, conocimientos y habilidades revisadas en la documentación a problemas con elementos diferentes.
* **Nivel avanzado**, en las que el alumno deberá ser capaz de amplicar las técnicas, conocimientos y habilidades aprendidas investigando nuevos aspectos, problemas o elementos.

# Importante

* El alumno deberá completar este cuaderno sin modificar las preguntas ni modificar la estructura del propio cuaderno (se pueden añadir celdas, pero no modificar ni eliminar las existentes)
* El entregable será el cuaderno Jupyter (no ficheros planos con código python, ni PDF's ni material en ningún otro soporte)
* El cuaderno Jupyter con las respuestas deberá poder ser reejecutado sin que se produzca ningún error
* Salvo que se pida lo contrario, no se cargará ningún fichero desde el equipo local. Si se pide cargar una imagen y se indica la url de la que descargarla, esto podrá hacerse copiando la url, pegándola en la barra de direcciones de un navegador, haciendo clic con el botón secundario del ratón en la imagen y seleccionando la opción que la descargue (esta opción dependerá del navegador que se esté usando). En este caso la imagen deberá descargarse en la misma carpeta en la que esté este cuaderno Jupyter.
* Salvo que se especifique otra cosa, deberán utilizarse siempre las herramientas proveídas por las librerías NumPy, Pandas, Seaborn o Matplotlib. No puede recurrirse a otras librerías.
* Salvo que se indique lo contrario, en cada ejercicio deberán cargarse los datos necesarios aun cuando hayan sido cargados en ejercicios anteriores (es decir, si el ejercicio hace referencia al DataFrame Tips de Seaborn, salvo que se especifique otra cosa lo primero que deberá hacerse es cargar dicho DataFrame, aun cuando haya sido cargado ya en un ejercicio anterior).

El incumplimiento de cualquiera de estas normal supondrá la invalidación del ejercicio o del apartado correspondiente.

Todos los ejercicios tienen el mismo valor (un punto) salvo el del nivel avanzado, que tiene dos puntos.

* [NIVEL BÁSICO: 5 puntos](#NIVEL-BÁSICO:-5-puntos)
* [NIVEL INTERMEDIO: 3 puntos](#NIVEL-INTERMEDIO:-3-puntos)
* [NIVEL AVANZADO: 2 puntos](#NIVEL-AVANZADO:-2-puntos)

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

**IMPORTAMOS LAS LIBRERIAS A USAR**  
En la celda anterior se importan las librerias que se van a usar asignandoles su alias

# NIVEL BÁSICO: 5 puntos
<div style = "float:right"><a style="text-decoration:none" href = "#inicio">Inicio</a></div>

### Ejercicio 1
<div style="background:#5D6D7E;padding:20px;color:#ffffff;margin-top:10px;">
Crea dos arrays unidimensionales de 5 valores aleatorios enteros entre 0 y 10 (ambos valores incluidos). Crea un nuevo array que concatene los dos arrays anteriores verticalmente para formar un array de 5 filas y dos columnas y asigna el resultado a la varible <strong>a</strong>.
</div>

**EJERCICIO 1**  
**Linea 1:** Generamos el primer array unidimensional aleatorio entre 0 y 11 para que me incluya el numero 10.  
**Linea 2:** Generamos el segundo array unidimensional aleatorio entre 0 y 11 para que me incluya el numero 10.  
**Linea 3:** Concatenamos ambos arrays y usamos column y le pasamos los dos arrays creados en las lineas anteriores y lo asignamos a la variable "a".  
**Linea 4:** Mostramos el nuevo array.

In [ ]:
m = np.random.randint(0,11,5)
n = np.random.randint(0,11,5)
a = np.column_stack([m,n])
a

array([[10,  3],
       [ 1,  1],
       [ 4,  6],
       [ 6,  8],
       [ 6,  3]])

<div style="background:#D8D8D8;padding:20px;color:#000000;margin-top:10px;">
Prueba ahora tu solución ejecutando la siguiente celda:
</div>

In [ ]:
a.shape

(5, 2)

### Ejercicio 2
<div style="background:#5D6D7E;padding:20px;color:#ffffff;margin-top:10px;">
Crea un array de dimensiones 5x10 formado por valores aleatorios enteros entre 0 y 10 (ambos valores incluidos) y cárgalo en la variable data. Sin usar bucles, sustituye los valores menores a 5 por 0.
</div>

**EJERCICIO 2**  
**Linea 1:** Generamos un nuevo array aleatorio pero en este caso le asignamos las filas y columnas solicitadas con **[]**, y lo asignamos a la variable data.    
**Linea 2:** Usamos el metodo **where** que nos permite establecer una condicion para reemplazar los valores, en este caso reemplazamos los menores a 5 con 0 y los que no cumplan esta condicion quedan iguales

In [ ]:
data = np.random.randint(0,11,[5,10]) #Generamos un array esta vez indicandole las filas y las columnas entre []
data = np.where(data < 5, 0 , data ) #Usamos el metodo where para hacer los reemplazos

<div style="background:#D8D8D8;padding:20px;color:#000000;margin-top:10px;">
Prueba ahora tu solución ejecutando la siguiente celda (el array no deberá incluir valores menores a 5 salvo los ceros):
</div>

In [ ]:
data

array([[ 8,  0,  7,  8,  0,  0,  0,  5,  9,  5],
       [ 0,  7, 10,  0,  0,  9,  0,  0,  8,  5],
       [ 9,  6,  0,  9,  0, 10,  9,  8, 10,  8],
       [ 0,  9,  5,  0,  0,  0,  0,  0,  0,  0],
       [ 0,  9,  0,  0,  0,  0,  5,  6,  7,  0]])

### Ejercicio 3
<div style="background:#5D6D7E;padding:20px;color:#ffffff;margin-top:10px;">
A partir del DataFrame Tips de la librería Seaborn extrae los valores de la cuarta y segunda filas en este orden (es decir, las filas con índice 3 y 1), y las columnas "sex", "size" y "tip" (también en este orden). Asigna el resultado a la variable <strong>sample</strong>.<br>
Para obtener la máxima nota, la selección deberá realizarse en un único paso.
</div>

**EJERCICIO 3**  
**Linea 1:** Cargamos el dataset "tips", usamos el metodo **loc** para extraer la tercera y primera fila en ese orden y a continuacion pasamos una **lista** con las columnas solicitadas, todo esto lo asignamos a la variable "sample".

In [ ]:
sample = sns.load_dataset("tips").loc[[3,1],["sex", "size", "tip"]]

<div style="background:#D8D8D8;padding:20px;color:#000000;margin-top:10px;">
Prueba ahora tu solución ejecutando la siguiente celda:
</div>

In [ ]:
sample

    sex  size   tip
3  Male     2  3.31
1  Male     3  1.66

### Ejercicio 4
<div style="background:#5D6D7E;padding:20px;color:#ffffff;margin-top:10px;">
    Carga en la variable <strong>tips</strong> el DataFrame tips proveído por la librería Seaborn. Crea una nueva columna ("total") que sume el valor de la columna "total_bill" y el de la columna "tips". Suponiendo que quien haya pagado cada comida ha pagado la cantidad indicada en la columna recién creada ¿cuántos clientes han desembolsado 40 o más dólares en total?
</div>

**EJERCICIO 4**  
**Linea 1:** Cargamos la libreria "tips".  
**Linea 2:** Generamos la nueva columna "total" la cual nos va a almacenar la **suma** entre las columnas "total_bill" y "tip" que representa el valor total desembolsado por el cliente.  
**Linea 3:** Usando el metodo **loc** extraemos todas las filas de nuestra nueva columna "total" donde su valor sea mayor o igual a 40 y lo asigno a un nuevo dataframe "total_tips" para no sobreescribir el original.  
**Linea 4:** Mostramos nuestro nuevo dataframe.  
**Linea 5:** Usando el metodo **count** podemos saber cuantos elementos tiene nuestra nueva columna, es decir que 19 personas desembolsaron 40 o mas dolares incluida la propina.

In [ ]:
tips = sns.load_dataset("tips")
tips["total"] = tips["total_bill"]+tips["tip"]
total_tips = tips.loc[tips.total >= 40]
total_tips

     total_bill    tip     sex smoker   day    time  size  total
11        35.26   5.00  Female     No   Sun  Dinner     4  40.26
23        39.42   7.58    Male     No   Sat  Dinner     4  47.00
52        34.81   5.20  Female     No   Sun  Dinner     4  40.01
56        38.01   3.00    Male    Yes   Sat  Dinner     4  41.01
59        48.27   6.73    Male     No   Sat  Dinner     4  55.00
85        34.83   5.17  Female     No  Thur   Lunch     4  40.00
95        40.17   4.73    Male    Yes   Fri  Dinner     4  44.90
102       44.30   2.50  Female    Yes   Sat  Dinner     3  46.80
112       38.07   4.00    Male     No   Sun  Dinner     3  42.07
141       34.30   6.70    Male     No  Thur   Lunch     6  41.00
142       41.19   5.00    Male     No  Thur   Lunch     5  46.19
156       48.17   5.00    Male     No   Sun  Dinner     6  53.17
170       50.81  10.00    Male    Yes   Sat  Dinner     3  60.81
182       45.35   3.50    Male    Yes   Sun  Dinner     3  48.85
184       40.55   3.00    Male    Yes   Sun  Dinner     2  43.55
197       43.11   5.00  Female    Yes  Thur   Lunch     4  48.11
207       38.73   3.00    Male    Yes   Sat  Dinner     4  41.73
212       48.33   9.00    Male     No   Sat  Dinner     4  57.33
238       35.83   4.67  Female     No   Sat  Dinner     3  40.50

In [ ]:
total_tips.total.count()

19

### Ejercicio 5
<div style="background:#5D6D7E;padding:20px;color:#ffffff;margin-top:10px;">
Escribe una función (llámala "nulls_number") que reciba como argumento un DataFrame Pandas y devuelva el número de valores nulos que contenga en total (es decir, entre todas las columnas).
</div>

**EJERCICIO 5**  
**Linea 1:** Definimos nuestra funcion y le indicamos que tome como parametro **df**  
**Linea 2:** Establecemos la funcion, en este caso queremos que tome el parametro df (nuestro dataframe), a continuacion con el parametro **isnull** va a buscar los campos que tengan valores nulos, despues con **sum** va a hacer una suma de estos por cada columna, como en este caso queremos saber el **total** de valores en todas las columnas volvemos a aplicar el metodo **sum** para que nos de un solo numero.

In [ ]:
def nulls_number(df):
    return df.isnull().sum().sum()

<div style="background:#D8D8D8;padding:20px;color:#000000;margin-top:10px;">
Prueba ahora tu solución ejecutando la siguiente celda:
</div

In [ ]:
titanic = sns.load_dataset("titanic")
nulls_number(titanic)

869

# NIVEL INTERMEDIO: 3 puntos
<div style = "float:right"><a style="text-decoration:none" href = "#inicio">Inicio</a></div>

### Ejercicio 1
<div style="background:#5D6D7E;padding:20px;color:#ffffff;margin-top:10px;">
A partir del DataFrame Titanic descargado de la librería Seaborn y creando una tabla dinámica a partir de él, responde a la siguiente pregunta: ¿En qué puerto los hombres y las mujeres de alguna clase (primera, segunda o tercera) pagaron en media exactamente lo mismo por su pasaje?
</div>

**EJERCICIO 1**  
**Linea 1:**  Cargamos nuestro dataset "titanic" y lo guardamos en el dataframe del mismo nombre  
**Linea 2:** Usamos el metodo **pivot_table** para generar nuestra nueva tabla dinamica en este caso como filas queremos el puerto de embarque y el sexo, como columnas seleccionamos la clase y como valores el precio promedio pagado por persona, para esto usamos como agregador **mean** y lo asignamos a titanic2  
**Linea 3:** Mostramos nuestro nuevo dataframe y respondiendo a nuestra pregunta: *En el puerto de Queenstown los hombres y las mujeres de primera y segunda clase pagaron el mismo valor por su pasaje*

In [ ]:
titanic = sns.load_dataset("titanic")
titanic2 = titanic.pivot_table(index = ["embark_town","sex"], columns = ["class"], values = ["fare"], aggfunc = "mean")
titanic2

                          fare
class                    First     Second      Third
embark_town sex
Cherbourg   female  115.640309  25.268457  14.694926
            male     93.536707  25.421250   9.352237
Queenstown  female   90.000000  12.350000  10.307833
            male     90.000000  12.350000  11.924251
Southampton female   99.026910  21.912687  18.670077
            male     52.949947  19.232474  13.307149

### Ejercicio 2
<div style="background:#5D6D7E;padding:20px;color:#ffffff;margin-top:10px;">
Lee el DataFrame Titanic proveído por la librería Seaborn y carga en la variable <strong>number</strong> el resultado de calcular el número de mujeres mayores de 38 años que hayan pagado más de 30 y menos de 40 libras.
</div>

**EJERCICIO 2**  
**Linea 1:** Cargamos nuestro dataset "titanic" y lo adignamos a nuestro dataframe con el mismo nombre.   
**Linea 2:** Para responder esta pregunta necesitamos hacer uso de **&** para concatenar todas las condiciones que nos solicitan las cuales vamos a poner una a una, al final usamos el metodo **sum** para obtener un solo valor y lo asignamos a la variable number.  
**Linea 3:** Mostramos nuestra variable number

In [ ]:
titanic = sns.load_dataset("titanic")
number = ((titanic.sex == "female") & (titanic.age > 38) & (titanic.fare > 30) & (titanic.fare < 40)).sum()
number

5

<div style="background:#D8D8D8;padding:20px;color:#000000;margin-top:10px;">
Prueba ahora tu solución ejecutando la siguiente celda:
</div>

In [ ]:
print("Hay {} mujeres mayores de 38 años que pagaron más de 30 y menos de 40 libras".format(number))

Hay 5 mujeres mayores de 38 años que pagaron más de 30 y menos de 40 libras

### Ejercicio 3
<div style="background:#5D6D7E;padding:20px;color:#ffffff;margin-top:10px;">
Escribe una función (llámala "fill_nulls") que reciba como argumento un dataframe Pandas y devuelva una copia del DataFrame tras sustituir los valores nulos de cada columna por el valor más frecuente en la columna sin usar bucles for o while.
</div>

In [ ]:
titanic.mode()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,24.0,0,0,8.05,S,Third,man,True,C,Southampton,no,True

**EJERCICIO 3**  
**Linea 1:** Definimos nuestra funcion, le damos nombre y le asignamos el parametro df.  
**Linea 2:** Creamos la variable local **fill** en la que con la funcion **mode** la cual nos proporciona la moda (el valor que mas se repite) y usamos **iloc** para acceder a la primera fila que es la que contiene la moda.  
**Linea 3:** Ya con nuestra variable fill procedemos a aplicarla en nuestro dataframe.   
**Linea 2:** Escribimos la salida de la funcion y pedimos que nos de una copia del dataframe.  
**Linea 2:** Cargamos el dataset "titanic".  
**Linea 2:** Aplicamos la funcion creada.  
**Linea 2:** Mostramos el dataframe para una rapida inspeccion visual comprobando que se aplico la funcion.

In [ ]:
def fill_nulls(df):
    fill = df.mode().iloc[0]
    df = df.fillna(fill)
    return df.copy()

In [ ]:
titanic = sns.load_dataset("titanic")
titanic = fill_nulls(titanic)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,C,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,C,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,C,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,24.0,1,2,23.4500,S,Third,woman,False,C,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,C,Queenstown,no,True

<div style="background:#D8D8D8;padding:20px;color:#000000;margin-top:10px;">
Prueba ahora tu solución ejecutando la siguiente celda:
</div>

In [ ]:
titanic = sns.load_dataset("titanic")
titanic = fill_nulls(titanic)
print(titanic.iloc[888, 3])
print(titanic.iloc[61, 7])
print(titanic.iloc[0, 11])

24.0
S
C

# NIVEL AVANZADO: 2 puntos
<div style = "float:right"><a style="text-decoration:none" href = "#inicio">Inicio</a></div>

### Ejercicio 1
<div style="background:#5D6D7E;padding:20px;color:#ffffff;margin-top:10px;">
    Carga en la variable <strong>titanic</strong> el DataFrame titanic proveído por la librería Seaborn, y utilizando el método groupby, calcula la edad media de los pasajeros según el puerto de embarque. Almacena el resultado en la variable "mean_age". Asegúrate de que en tu resultado solo estás incluyendo la variable "age" (y los nombres de los puertos, por supuesto).
</div>

**EJERCICIO 1a**
**Linea 1:** Cargamos el dataframe titanic.  
**Linea 1:** Usamos el metodo groupby para agrupar las personas de acuerdo al puerto de embarque, de este resultado vamos a tomar solo la columna de la edad y con el metodo **mean** obtenemos el promedio y lo guardamos en la variable mean_age.  
**Linea 1:** Mostramos nuestra variable mean_age

In [ ]:
titanic = sns.load_dataset("titanic")
mean_age = titanic.groupby(["embark_town"])["age"].mean()
mean_age

embark_town
Cherbourg      30.814769
Queenstown     28.089286
Southampton    29.445397
Name: age, dtype: float64

<div style="background:#D8D8D8;padding:20px;color:#000000;margin-top:10px;">
Prueba ahora tu solución ejecutando la siguiente celda:
</div>

In [ ]:
print("La edad media de los pasajeros de Queenstown fue de {} años".format(mean_age["Queenstown"]))

La edad media de los pasajeros de Queenstown fue de 28.089285714285715 años

<div style="background:#5D6D7E;padding:20px;color:#ffffff;margin-top:10px;">
    A continuación, usando el método <i>fillna</i> <strong>una sola vez</strong>, sustituye (inplace) los valores nulos del campo "age" del DataFrame <strong>titanic</strong> por los valores obtenidos en el apartado anterior (es decir, sustituye en el DataFrame <strong>titanic</strong> cada edad nula por el valor medio de la edad de los pasajeros que hayan embarcado en el mismo puerto).
</div>

**EJERCICIO 1b**  
**Linea 1:** En esta linea tomando la columna "age", con esto vamos a operar sobre esta columna especifica del dataframe, entonce primero vamos a poner como indice del dataframe el puerto de embarque con el metodo **set_index** y asi aprovechamos que pandas compara los indicies del dataframe cuando hace operaciones teniendo en cuenta que nuestra variable mean_age tiene el mismo indice, una vez hecho esto seleccionamos solo la columna "age" y le aplicamos el metodo **fillna** para que reemplace los valores nulos, como ultimo volvemos a poner los valores de los indices por defecto con **reset_index** le damos ademas el parametro **drop=True** para que no nos genere una nueva columna con los valores del indice anterior.  
**Linea 2:** Mostramos nuestro dataframe para hacer una breve inspeccion de nuestro indice.

In [ ]:
titanic.age = titanic.set_index("embark_town")["age"].fillna(mean_age).reset_index(drop=True)

In [ ]:
#titanic.age = titanic.set_index("embark_town")["age"].fillna(mean_age, inplace = True)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,29.445397,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

<div style="background:#D8D8D8;padding:20px;color:#000000;margin-top:10px;">
Prueba ahora tu solución ejecutando la siguiente celda:
</div>

In [ ]:
print(titanic.iloc[26, 3])
print(titanic.iloc[5, 3])
print(titanic.iloc[17, 3])

30.81476923076923
28.089285714285715
29.44539711191336